### Pandas String and Regular Expression: https://www.w3resource.com/python-exercises/pandas/string/index.php

In [2]:
import pandas as pd
import numpy as np

##### 6. Write a Pandas program to count of occurrence of a specified substring in a DataFrame column.

In [3]:
df_sub = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]})

df_sub['count'] = list(map(lambda x: x.count("2"), df_sub['date_of_birth']))

df_sub

  name_code date_of_birth   age  count
0      c001    12/05/2002  18.5      3
1      c002    16/02/1999  21.2      1
2      c022    25/09/1998  22.5      1
3     c2002    12/02/2022  22.0      5
4     c2222    15/09/1997  23.0      0

In [4]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df_main = pd.DataFrame(data=exam_data, index=labels)

In [12]:
df_submain = df_main.copy()
# df_submain['name'] = df_submain['name'].str.lower()
df_submain['count_a'] = list(map(lambda x: x.lower().count('a'), df_submain['name']))
df_submain

        name  score  attempts qualify  count_a
a  Anastasia   12.5         1     yes        4
b       Dima    9.0         3      no        1
c  Katherine   16.5         2     yes        1
d      James    NaN         3      no        1
e      Emily    9.0         2      no        0
f    Michael   20.0         3     yes        1
g    Matthew   14.5         1     yes        1
h      Laura    NaN         1      no        2
i      Kevin    8.0         2      no        0
j      Jonas   19.0         1     yes        1